uhnp/src/Catalogs/НастройкиПроцессаВыбора/НастройкиПроцессаВыбора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НастройкиПроцессаВыбора</name>
  <attributes>
    <name>ПоследнийЭтап</name>
    <type>
      <types>CatalogRef.ЭтапыОценки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяТипаОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяТипаВладельца</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СинонимОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СинонимВладельца</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоследующаяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьРасчетныеЗначенияИсточникаДанных</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаЗавершена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КритерииОценки</name>
    <attributes>
      <name>ЭтапВыбора</name>
      <type>
        <types>CatalogRef.ЭтапыОценки</types>
      </type>
    </attributes>
    <attributes>
      <name>КритерийОценки</name>
      <type>
        <types>CatalogRef.КритерииВыбора</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>11</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МинимальноеЗначение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксимальноеЗначение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеИспользоватьПреобразованиеВБаллы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбратныйПорядокБаллов</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>От0</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>До0</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>От1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>До1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>От2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>До2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>От3</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>До3</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>От4</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>До4</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>До5</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>От5</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>К0</name>
      <comment>Для нормализации значений: К1*[Значение критерия] + K0</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>К1</name>
      <comment>Для нормализации значений: К1*[Значение критерия] + K0</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсточникДанных</name>
      <type>
        <types>CatalogRef.ИсточникиДанныхДляРасчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>РассчитатьЗначение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ФиксироватьВес</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОценочнаяКомиссия</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗакрываетЭтапОценки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭтапыВыбора</name>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.ЭтапыОценки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Catalogs/НастройкиПроцессаВыбора/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка ИЛИ Предопределенный Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаКритерия Из КритерииОценки Цикл
		Если СтрокаКритерия.МаксимальноеЗначение <> 0 Тогда
			Длинна_ = СтрокаКритерия.МаксимальноеЗначение - СтрокаКритерия.МинимальноеЗначение;
			СтрокаКритерия.К1 = ?(Длинна_=0, 1, Длинна_);
			СтрокаКритерия.К0 = - СтрокаКритерия.МинимальноеЗначение / ?(Длинна_=0, 1, Длинна_);
		Иначе
			СтрокаКритерия.К1 = 1;
			СтрокаКритерия.К0 = - СтрокаКритерия.МинимальноеЗначение;
		КонецЕсли;
		
	КонецЦикла;
	
	ИндексСтрокиПоследнегоЭтапа = ЭтапыВыбора.Количество()-1;
	
	Если ИндексСтрокиПоследнегоЭтапа >= 0 Тогда
		Если ЭтапыВыбора[ИндексСтрокиПоследнегоЭтапа].Этап = Справочники.ЭтапыОценки.ПоследующаяОценка Тогда
			ИндексСтрокиПоследнегоЭтапа = ИндексСтрокиПоследнегоЭтапа - 1;
			Если ИндексСтрокиПоследнегоЭтапа >= 0 Тогда
				ПоследнийЭтап = ЭтапыВыбора[ИндексСтрокиПоследнегоЭтапа].Этап;
			КонецЕсли;
		Иначе
			ПоследнийЭтап = ЭтапыВыбора[ИндексСтрокиПоследнегоЭтапа].Этап;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка ИЛИ Предопределенный Тогда
		Возврат;
	КонецЕсли;
	
	ВыборОбъектовУХ.ОбновитьРегистрациюОбъектовВыбора(Ссылка);
	ВыборОбъектовУХ.ОбновитьЭкспертовЭтапов(Ссылка);
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	// Проверим, что суммарный вес равен 1.
	Выгрузка = КритерииОценки.Выгрузить();
	Выгрузка.Свернуть("ЭтапВыбора", "Вес");
	Для Каждого ТекВыгрузка Из Выгрузка Цикл
		Если ТекВыгрузка.Вес <> 1 Тогда
			Отказ = Истина;
			ТекстСообщения = НСтр("ru = 'Суммарный вес критериев в этапе ""%Этап%"" составляет %Вес%. Для корректной работы требуется 1. Запись отменена.'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Этап%", Строка(ТекВыгрузка.ЭтапВыбора));
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Вес%", Строка(ТекВыгрузка.Вес));
			ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
		Иначе
			// Проверка пройдена успешно.
		КонецЕсли;
	КонецЦикла;	
	
	//Проверка на корректность оценок
	Критерии=КритерииОценки.Выгрузить();
	Для Каждого СтрокаКритерии из Критерии Цикл
		Если Не СтрокаКритерии.НеИспользоватьПреобразованиеВБаллы	
			и (СтрокаКритерии.До0<>СтрокаКритерии.От1 или  СтрокаКритерии.До1<>СтрокаКритерии.От2 
			или СтрокаКритерии.До3<>СтрокаКритерии.От4 или СтрокаКритерии.До4<>СтрокаКритерии.От5) тогда
			Отказ = Истина;
			ТекстСообщения = НСтр("ru = 'По критерию ""%КритерийОценки%"" не совпадает значение конечного балла с начальным.'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%КритерийОценки%", Строка(СтрокаКритерии.КритерийОценки));
			ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
			
		КонецЕсли;	
	КонецЦикла;	
	// Проверим, что существует хотя бы один эксперт с правами завершения этапа.
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("ЗакрываетЭтапОценки", Истина);
	НайденныеСтроки = ОценочнаяКомиссия.НайтиСтроки(СтруктураПоиска);
	Если НайденныеСтроки.Количество() < 1 Тогда
		Отказ = Истина;
		ТекстСообщения = НСтр("ru = 'В оценочной комиссии не назначен ни один эксперт, уполномоченный закрывать этап оценки. Запись отменена.'");
		ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
	Иначе
		// Проверка пройдена успешно.
	КонецЕсли;
КонецПроцедуры

#КонецЕсли
